{"pages":[{"title":"about","text":"","link":"/about/index.html"},{"title":"music","text":"单曲循环","link":"/music/index.html"},{"title":"photos","text":"","link":"/photos/index.html"}],"posts":[{"title":"Come on, Wuhan! Come on, China!","text":"The epidemic stroke 2020At the end of 2019, a disaster took place in Hubei province, China. Early in the outbreak of the pandemic, a few patients with fever went to the hospital in Wuhan and these patients had the same symptoms including cough, difficulty to breathe and some other signs of the pneumonia. The doctors used antibiotic drugs to treat these patients, however, the situation of these patients did not improved at all. The doctors of this hospital reported the finding to their leaders as soon as they got this discovery. In their view, the disease of these patients is not ordinary, instead, this is a kind of serious unknown disease. They also found that these patients went to the same seafood market a few days ago. Therefore, they suspected that this disease is a kind of infectious disease and this disease was called unknown pneumonia. Though the government of Hubei province had got the information of this event, the event did not attract their enough attention. The officials of the governments in Hubei province thought this was only a minor health incident and this problem would soon be solved. Unexpectedly, this event was not as simple as they thought. On the contrary, this unknown disease began to spread in Hubei with lots of people infected. At that time, I was still at school and knew little about this event. In my view, this event was so simple that more attention need not to be focused on it and it could be dealt with properly and quickly. Most people also paid little attention to it and were immersed in the happiness of Spring Festival like me. The epidemic impacts our lifeAt the time when I just came home, the epidemic began to spread all over the world quietly, but to my surprise, there were no infected people in my hometown, Bayannur, which located in the northwest of Inner Mongolia. I naively thought that I was very safe and this event had nothing to do with me. I could spend a happy new year with my family. However, my happy life only lasted until New Year’s Eve because my hometown was also infected. shortly, the community where my home is located in was closed and any cars were forbidden to enter or leave my community. Besides, people who do not live in my community were also banned to enter my community. My family always stay together during this time every year, however, other people in my family except my parents can not come to house. This Spring Festival looks particularly deserted. How happy I am compared to medical staff, Party members and everyone else who makes much contribution to this battle against the epidemic. What I can do for this battle is that I should persuade my family to stay at home until the victory of this battle. In addition, even though we can not go outside, we can also exercise at home with the help of some software about how to do sports at home to strengthen our body which can prevents us from infected by the virus. All of us are warriors of this war and fight against the damn virus. We must be the winner of this battleSince the appearance of this epidemic, lots of people, including lots of medical staff, Party members, military medics and so on have been involved in this war. President Xi directs and deploys this war personally and what we should do is to obey the decision of the Party Central Committee. I believe our great party led by President Xi will lead us to victory. Chinese people are always together and our hearts are linked together. That is why the Chinese civilization is the only uninterrupted civilization. We have faced lots of disasters together including Tangshan Earthquake, Wenchuan Earthquake, southern ice snow disaster and so on. Every time we led by Communist Party got through the difficulties and finally made great success. This time I also have no doubt that we will and must win this war. Come on Wuhan! Come on China!","link":"/2020/02/08/Come-on-WuHan/"},{"title":"Spring has come!","text":"Winter passed, Spring has comeNot long ago, the most important festival for Chinese nation , Spring Festival, passed, which indicates that winter passed and spring has come. However, all of us are sure to spend an unforgettable festival due to the outbreak of the epidemic. Impacted by this pneumatic, the pace of the spring never stopped. Even though the temperature of my hometown, located in the northwest of Inner Mongolia, is still dropping, I have felt the warmth of spring and I am eager to play basketball outdoors. Yesterday, there was a light snow in my hometown and everything was covered with snow as if the world put on a white blanket and I felt that I was in the fairy tale world. There is a well-known saying that “a timely snow promises a good harvest and at the same time, it is also snowing in Wuhan, Hubei province. I think it is a hint that this severe epidemic will soon be overcome and then our country will be more vibrant than ever before. Our country will become more powerful than ever before through this epidemic. The scenery of nature in my hometownHere, I will show some beautiful pictures of my hometown to you and want to tell you that our eyes should not be covered by lots of sad and broken-heart things, however, we should discover more wonderful and brilliant world with our eyes. Only in this way can we find that our world we live in is so wonderful in fact. In spring my hometown is very beautiful and I want to share the beautiful scenery with you together. Welcome to my beautiful hometown, Inner Mongolia!","link":"/2020/02/05/Spring-has-come/"}],"tags":[{"name":"diary","slug":"diary","link":"/tags/diary/"}],"categories":[{"name":"life","slug":"life","link":"/categories/life/"},{"name":"writing","slug":"life/writing","link":"/categories/life/writing/"}]}